app/views/users/index.html.erb

        <h1><%= user.name %></h1>
        <p class="user-info">Number of Posts: <%= user.posts.count %></p>
---
SELECT "users".* FROM "users"