app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 3], ["post_id", 2]]
---
      <li><%= render post %></li>
      <% post.recent_comments.each do |comment| %>