app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(text: comment_params[:text]) # Use the correct parameter name
    @comment.user = current_user

    if @comment.save
      @post.increment!(:comments_counter)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["text", nil], ["created_at", "2023-08-30 20:19:46.193326"], ["updated_at", "2023-08-30 20:19:46.193326"]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 1]]