app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @posts = @user.recent_posts.includes(:comments)