app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 3], ["post_id", 2]]
---
  def index
    @user = current_user
    @posts = @user.recent_posts.includes(:comments)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.includes(:comments).find(params[:id])

INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author_id", 1], ["title", "test"], ["text", "ewf"], ["comments_counter", nil], ["likes_counter", nil], ["created_at", "2023-08-31 02:56:45.378861"], ["updated_at", "2023-08-31 02:56:45.378861"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) - $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2023-08-31 03:14:25.069800"], ["updated_at", "2023-08-31 03:14:25.069800"]]
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 1]]
---
  def like
    @post = Post.find(params[:id])
    existing_like = @post.likes.find_by(user: current_user)

    if existing_like
      existing_like.destroy
      @post.decrement!(:likes_counter)
    else
      current_user.likes.create(post: @post)
      @post.increment!(:likes_counter)