app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all # Fetch all users from the database

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  def show
    @user = User.find(params[:id]) # Find a user by ID
    @posts = @user.posts.includes(:comments)