app/models/post.rb

def increment_user_posts_count
  user.increment!(:posts_count)
---
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 1]]